IDENTIFICATION DIVISION.
PROGRAM-ID. CBLTEST.
DATA DIVISION.
LINKAGE SECTION.
01 PARAM1.
02 CHILD1 PIC 99.
02 CHILD2 PIC 99.
PROCEDURE DIVISION USING PARAM1.
BEGIN.
STOP RUN.
HALT.