           03 PO2_ESTASK              PIC 9(4).
           03 PO2_ESPEUL              PIC 9(2).
           03 PO2_ESKERR              PIC 9.
           03 PO2_ESKERR_NR           PIC 9.
           03 PO2_ESTVER.
              05 PO2_ESTVER_O OCCURS 9.
                 07 PO2_ESERNO           PIC 9.
                 07 PO2_ESERKD           PIC 9(4).
                 07 PO2_ESERSG           PIC 9.
                 07 PO2_ESERTX           PIC X(80).
                 07 PO2_ESFLDN           PIC X(10).
