      03  :XXX:SAMPCPY1.                                              
        05 :XXX:MYVAR                 PIC X(20) VALUE SPACES.         
        05 :XXX:OTHER-VAR             PIC S9(8) COMP.                 
            88 :XXX:VAR-SET-OK        VALUE 0.                        
            88 :XXX:VAR-SET-NOTOK     VALUE 4.                        
            88 :XXX:VAR-SET-OTHER     VALUE 8.  