      03  C00-SAMPCPY1.                                              
        05 C00-MYVAR                 PIC X(20) VALUE SPACES.         
        05 C00-OTHER-VAR             PIC S9(8) COMP.                 
            88 C00-VAR-SET-OK        VALUE 0.                        
            88 C00-VAR-SET-NOTOK     VALUE 4.                        
            88 C00-VAR-SET-OTHER     VALUE 8.  
