           03 CM-VARS.                                       
              05 CM-MYVAR                  PIC X(20).        
              05 CM-OTHER-VAR              PIC S(9).         
              05 CM-ANOTHER-VAR            PIC X.            