IDENTIFICATION DIVISION.
PROGRAM-ID. CBLTEST.
DATA DIVISION.
LINKAGE SECTION.
01 PARAM1 PIC 99.
01 PARAM2 PIC 9V9.
01 PARAM3 PIC X(4).
PROCEDURE DIVISION USING PARAM1,PARAM2,PARAM3.
BEGIN.
STOP RUN.
HALT.