IDENTIFICATION DIVISION.
PROGRAM-ID. CBLTEST.
DATA DIVISION.
LINKAGE SECTION.
01  FIELD  PIC X(10) OCCURS 5.
01  PART OCCURS 3.
	02  CHILD1  PIC X(10).
	02  CHILD2  PIC 99 OCCURS 6.
PROCEDURE DIVISION USING FIELD PART.
BEGIN.
STOP RUN.
HALT.