1.00 130526        IDENTIFICATION DIVISION.                                                 
2.00 130526        PROGRAM-ID ROICBL.                                                       
3.00 130526        PROCEDURE DIVISION.                                                      
4.00 130526            DISPLAY 'HELLO WORLD'.                                               
5.00 130526            STOP RUN.                                                            
6.00 130526        HALT.                                                                    
