           03 PI1_ESTASK              PIC 9(4).
           03 PI1_ESPEUL              PIC 9(2).
           03 PI1_ESSVIV              PIC 9(2).
           03 PI1_ESKDMK              PIC 9(6).
           03 PI1_ESUSER              PIC X(10).
           03 PI1_ESBOXN              PIC 9(4).
           03 PI1_ESKODB              PIC 9(2).
           03 PI1_ESUSRK              PIC 9(2).
           03 PI1_ESCOMP              PIC 9.
           03 PI1_ESMHOZ              PIC 9(2).
           03 PI1_ESACC1              PIC 9(6).
           03 PI1_ESACC2              PIC 9(6).
           03 PI1_ESFILR              PIC X(50).